In [43]:
import numpy as np
import pandas as pd

In [44]:
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)

In [45]:
sozluk = {"var1" : s1, "var2" : s2, "var3" : s3}
df = pd.DataFrame(sozluk)

In [46]:
df

   var1  var2  var3
0     0     2     2
1     1     6     6
2     6     4     2
3     0     3     1
4     3     8     4

In [47]:
df[0:1]

   var1  var2  var3
0     0     2     2

In [48]:
df.index = ["a","b","c", "d","e"]
df

   var1  var2  var3
a     0     2     2
b     1     6     6
c     6     4     2
d     0     3     1
e     3     8     4

In [49]:
df[0:1]

   var1  var2  var3
a     0     2     2

In [50]:
df["c" : "e"]

   var1  var2  var3
c     6     4     2
d     0     3     1
e     3     8     4

In [51]:
df.drop("a", axis=0)

   var1  var2  var3
b     1     6     6
c     6     4     2
d     0     3     1
e     3     8     4

In [52]:
df

   var1  var2  var3
a     0     2     2
b     1     6     6
c     6     4     2
d     0     3     1
e     3     8     4

In [53]:
df.drop("a", axis=0, inplace=True)
df

   var1  var2  var3
b     1     6     6
c     6     4     2
d     0     3     1
e     3     8     4

In [54]:
df

   var1  var2  var3
b     1     6     6
c     6     4     2
d     0     3     1
e     3     8     4

In [55]:
l = ["var1", "var2", "var3"]
for i in l:
    print(i in l)

True
True
True

In [56]:
df["var4"] = df["var1"] / df["var2"]
df

   var1  var2  var3      var4
b     1     6     6  0.166667
c     6     4     2  1.500000
d     0     3     1  0.000000
e     3     8     4  0.375000

In [57]:
df.drop("var4", axis = 1, inplace= True)
df

   var1  var2  var3
b     1     6     6
c     6     4     2
d     0     3     1
e     3     8     4

In [58]:
l = ["var1", "var2"]
df.drop(l, axis=1)

   var3
b     6
c     2
d     1
e     4